{"reviewerID": "A1UQBFCERIP7VJ", "asin": "B00KKXCJQU", "reviewerName": "Margaret Picky", "helpful": [1, 1], "reviewText": "These are very nice packing cubes and the 18 x 21 in. laundry and storage bag is a nice bonus.The four-inch depth and mix of sizes provided is ideal for organizing suitcases, and especially rolling carry-ons, which are typically limited to approximately 22 in. x 14 in. x 9 in.Combining two sets allows for even more versatility and choice; I would suggest getting three sets to use for a couple.They are indeed very well-made, just as claimed, with high-quality and smoothly-working zippers with easy-to-spot pulls, contrasting taped seams, and carrying handles. The nylon fabric is tough and water-resistant and the ventilating mesh on top is snag-resistant.I have been looking at packing cubes in different stores and online for several years, and these are the most thoughtfully-designed ones that I've seen, both overall and particularly for the four-inch depth.A sample was provided for evaluation and review", "overall": 5.0, "summary": "Convenient, lightweight, and durable", "unixReviewTime": 1402185600, "reviewTime": "06 8, 2014"}
{"reviewerID": "A22CW0ZHY3NJH8", "asin": "B00KKXCJQU", "reviewerName": "Noname", "helpful": [2, 2], "reviewText": "I am on vacation with my family of four and this Shacke Pak set has been wonderful.  Except for my husband, we all share the same suitcase.  Underwear and socks have always been a jumble, but not anymore.  Each kid gets his and her own Shacke Pak.  I get one, also, and there was one to spare for my loose personal supplies.  How wonderful not to have my luggage look all a clutter.The set comes with a laundry bag, which I admit is a bit small for a family, or even a single person who's packed for more than a weekend trip.  Bags on trips will always find a purpose, though.  I used it to haul my supplies from the cabin to the showers.The Shack Pak bags are getting a good workout, as we are basically running them through three separate vacations this month.  I'm still using them and my daughter will be using it next week.I like the mesh that lets us see what's inside without opening the bags.  The zippers are solid and the nylon is durable.  The bags are taking a beating and holding up well.  When done, they will nest inside each other neatly, ready for our next trip.This product was provided for review by Shacke.", "overall": 5.0, "summary": "Holds Up Well In Real World Test", "unixReviewTime": 1404691200, "reviewTime": "07 7, 2014"}
{"reviewerID": "A30VWT3R25QAVD", "asin": "B00KKXCJQU", "reviewerName": "THE-DEADLY-DOG \"Living and Loving Life.\"", "helpful": [0, 1], "reviewText": "When I signed up to receive a free set of Shacke Pak for review I thought to myself &#34;What the heck am I taking this for? I don't do any travel, don't do any vacations, and don't even go out to do laundry.&#34; I suppose it was the desire to posses more &#34;goodies&#34; that truly drove me, but man was I happy when I cracked the plastic bag and checked these bad boys out.What impressed me the most, (and I will keep this review short to save people the agony of reading my diatribe) was the size in comparison to other travel bags and their portability. When looking at the package it appears as though you may be thoroughly disappointed, but the second you crack these bags open you watch in amazement as they expand and truly do hold large quantities of goods. I received my free packing cube set on June 7th and have been using them for little things ever since. Whether it's carrying my uniform into work, bringing clothes down to the laundry room, or moving items around to better organize and keep these together these bags are tough, they are durable, and they are convenient.I am truly pleased with this Shacke product, and had it been the other way around--with me looking for some good travel/storage bags, this is where I would go.5 Agile, Mobile, and Versatile Stars out of 5!", "overall": 5.0, "summary": "Don't Travel? Still Way too Useful for 'Average Joe'", "unixReviewTime": 1403481600, "reviewTime": "06 23, 2014"}

